/*! \page0  CPU 编程指南
*
* - APP memory
*   -# DATA  0x30 ~ 0x7F\n
*   -# IDATA 0x80 ~ 0xFF\n
*   -# PDATA 0x0001 ~ 0x00FF\n
*   -# XDATA 0x000980 ~ 0x00144F\n
*   -# CODE  0x00C000 ~ 0x000FEFF\n

*
* - interrupt
*   -# TIMER0                  0 \n
*   -# TIMER1                  1 \n
*   -# TIMER2                  2 \n
*   -# TIMER3                  3 \n
*   -# RTC                     4 \n
*   -# USB_SOF                 5 \n
*   -# USB_CTL                 6 \n
*   -# UART/BreakPoint         7 \n
*   -# PORT                    8 \n
*   -# OBUF/MPDEC              9 \n
*   -# SINT                    10 \n
*   -# ISD2W/StackDetect       11 \n
*   -# SDC                     12 \n
*   -# SPI, IIC                13 \n
*   -# LVD/WDT/OSC_LOST/ADC    14 \n
*   -# SOFT                    15 \n

*
*   -# IP0L和IP0H 中断优先级控制寄存器，共同决定了中断源0-7的优先级,可读可写\n
*      IP0H和IP0L的Bit0：TIMER0 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit1：TIMER1 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit2：TIMER2 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit3：TIMER3 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n

*   -# IP0L和IP0H 中断优先级控制寄存器，共同决定了中断源0-7的优先级,可读可写\n
*      IP0H和IP0L的Bit4：RTC    优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit5：USB_SOF 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit6：USB_CTL 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP0H和IP0L的Bit7：UART   优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n

*   -# IP1L和IP1H 中断优先级控制寄存器，共同决定了中断源8-15的优先级,可读可写\n
*      IP1H和IP1L的Bit0：PORT 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP1H和IP1L的Bit1：OBUF 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP1H和IP1L的Bit2：SINT 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP1H和IP1L的Bit3：ISD2W 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n

*   -# IP1L和IP1H 中断优先级控制寄存器，共同决定了中断源8-15的优先级,可读可写\n
*      IP1H和IP1L的Bit4：SDC 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP1H和IP1L的Bit5：SPI/IIC 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n
*      IP1H和IP1L的Bit6：LVD/WDT/OSC_LOST/ADC 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；\n
*      第3级优先级\n
*      IP1H和IP1L的Bit7：SOFT 优先级选择：00；第0级优先级，01；第1级优先级，10；第2级优先级，11；第3级优先级\n

*/
